Tekla Open API Reference for Tekla Structures 2025
Text.TextAttributes.Alignment Property
 The text object's alignment (left, center, right).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TextAlignment Alignment { get; set; }
Public Property Alignment As TextAlignment
	Get
	Set
Property Value
Type: TextAlignment
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace